In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in c:\users\luciana.santos\appdata\local\anaconda3\lib\site-packages (4.0.1)
Requirement already satisfied: py4j==0.10.9.9 in c:\users\luciana.santos\appdata\local\anaconda3\lib\site-packages (from pyspark) (0.10.9.9)

In [2]:
#Create Sample Data

from pyspark.sql import SparkSession
from pyspark.sql.functions import lit
from datetime import datetime

In [3]:
# Sample Data
data = [
    (1, "John Doe", "2024-08-01", 23, 1000.50),
    (2, "Jane Smith", "2024-08-02", 34, 2000.75),
    (3, "Jake White", "2024-08-03", 18, 3000.10),
    (4, "Jill Black", "2024-08-04", 45, 4000.25),
    (5, "James Brown", "2024-08-05", 29, 1500.30),
    (6, "Aryan Shetty", "2024-08-06", 22, 2500.45),

]

In [5]:
import pandas as pd

# Create DataFrame
df = pd.DataFrame(data, columns=["id", "name", "date", "age", "amount"])

In [6]:
df

   id          name        date  age   amount
0   1      John Doe  2024-08-01   23  1000.50
1   2    Jane Smith  2024-08-02   34  2000.75
2   3    Jake White  2024-08-03   18  3000.10
3   4    Jill Black  2024-08-04   45  4000.25
4   5   James Brown  2024-08-05   29  1500.30
5   6  Aryan Shetty  2024-08-06   22  2500.45

In [8]:
df.head()

   id         name        date  age   amount
0   1     John Doe  2024-08-01   23  1000.50
1   2   Jane Smith  2024-08-02   34  2000.75
2   3   Jake White  2024-08-03   18  3000.10
3   4   Jill Black  2024-08-04   45  4000.25
4   5  James Brown  2024-08-05   29  1500.30